[
    {
        "tags":
        [
            "A01:2021 – Broken Access Control"
        ],
        "testcase": "Broken Access Control",
        "details": "<h2>Factors</h2><table style=\"width:997.312px;\"><tbody><tr><td><p><strong>CWEs Mapped</strong></p></td><td><p><strong>Max Incidence Rate</strong></p></td><td><p><strong>Avg Incidence Rate</strong></p></td><td><p><strong>Avg Weighted Exploit</strong></p></td><td><p><strong>Avg Weighted Impact</strong></p></td><td><p><strong>Max Coverage</strong></p></td><td><p><strong>Avg Coverage</strong></p></td><td><p><strong>Total Occurrences</strong></p></td><td><p><strong>Total CVEs</strong></p></td></tr><tr><td><p>34</p></td><td><p>55.97%</p></td><td><p>3.81%</p></td><td><p>6.92</p></td><td><p>5.93</p></td><td><p>94.55%</p></td><td><p>47.72%</p></td><td><p>318,487</p></td><td><p>19,013</p></td></tr></tbody></table><h2></h2><h2>Overview</h2><p>Moving up from the fifth position, 94% of applications were tested for some form of broken access control with the average incidence rate of 3.81%, and has the most occurrences in the contributed dataset with over 318k. Notable Common Weakness Enumerations (CWEs) included are <em>CWE-200: Exposure of Sensitive Information to an Unauthorized Actor</em>, <em>CWE-201: Insertion of Sensitive Information Into Sent Data</em>, and <em>CWE-352: Cross-Site Request Forgery</em>.</p><h2></h2><h2>Description</h2><p>Access control enforces policy such that users cannot act outside of their intended permissions. Failures typically lead to unauthorized information disclosure, modification, or destruction of all data or performing a business function outside the user's limits. Common access control vulnerabilities include:</p><ul><li>Violation of the principle of least privilege or deny by default, where access should only be granted for particular capabilities, roles, or users, but is available to anyone.</li><li>Bypassing access control checks by modifying the URL (parameter tampering or force browsing), internal application state, or the HTML page, or by using an attack tool modifying API requests.</li><li>Permitting viewing or editing someone else's account, by providing its unique identifier (insecure direct object references)</li><li>Accessing API with missing access controls for POST, PUT and DELETE.</li><li>Elevation of privilege. Acting as a user without being logged in or acting as an admin when logged in as a user.</li><li>Metadata manipulation, such as replaying or tampering with a JSON Web Token (JWT) access control token, or a cookie or hidden field manipulated to elevate privileges or abusing JWT invalidation.</li><li>CORS misconfiguration allows API access from unauthorized/untrusted origins.</li><li>Force browsing to authenticated pages as an unauthenticated user or to privileged pages as a standard user.</li></ul><h2></h2><h2>How to Prevent</h2><p>Access control is only effective in trusted server-side code or server-less API, where the attacker cannot modify the access control check or metadata.</p><ul><li>Except for public resources, deny by default.</li><li>Implement access control mechanisms once and re-use them throughout the application, including minimizing Cross-Origin Resource Sharing (CORS) usage.</li><li>Model access controls should enforce record ownership rather than accepting that the user can create, read, update, or delete any record.</li><li>Unique application business limit requirements should be enforced by domain models.</li><li>Disable web server directory listing and ensure file metadata (e.g., .git) and backup files are not present within web roots.</li><li>Log access control failures, alert admins when appropriate (e.g., repeated failures).</li><li>Rate limit API and controller access to minimize the harm from automated attack tooling.</li><li>Stateful session identifiers should be invalidated on the server after logout. Stateless JWT tokens should rather be short-lived so that the window of opportunity for an attacker is minimized. For longer lived JWTs it's highly recommended to follow the OAuth standards to revoke access.</li></ul><p>Developers and QA staff should include functional access control unit and integration tests.</p><h2></h2><h2>Example Attack Scenarios</h2><p><strong>Scenario #1:</strong> The application uses unverified data in a SQL call that is accessing account information:</p><pre> pstmt.setString(1, request.getParameter(\"acct\"));\n ResultSet results = pstmt.executeQuery( );\n</pre><p>An attacker simply modifies the browser's 'acct' parameter to send whatever account number they want. If not correctly verified, the attacker can access any user's account.</p><pre> https://example.com/app/accountInfo?acct=notmyacct\n</pre><p><strong>Scenario #2:</strong> An attacker simply force browses to target URLs. Admin rights are required for access to the admin page.</p><pre> https://example.com/app/getappInfo\n https://example.com/app/admin_getappInfo\n</pre><p>If an unauthenticated user can access either page, it's a flaw. If a non-admin can access the admin page, this is a flaw.</p><h2></h2><h2>References</h2><ul><li><a href=\"https://owasp.org/www-project-proactive-controls/v3/en/c7-enforce-access-controls\" rel=\"noopener noreferrer\" target=\"_blank\">OWASP Proactive Controls: Enforce Access Controls</a></li><li><a href=\"https://owasp.org/www-project-application-security-verification-standard\" rel=\"noopener noreferrer\" target=\"_blank\">OWASP Application Security Verification Standard: V4 Access Control</a></li><li><a href=\"https://owasp.org/www-project-web-security-testing-guide/latest/4-Web_Application_Security_Testing/05-Authorization_Testing/README\" rel=\"noopener noreferrer\" target=\"_blank\">OWASP Testing Guide: Authorization Testing</a></li><li><a href=\"https://cheatsheetseries.owasp.org/cheatsheets/Authorization_Cheat_Sheet.html\" rel=\"noopener noreferrer\" target=\"_blank\">OWASP Cheat Sheet: Authorization</a></li><li><a href=\"https://portswigger.net/blog/exploiting-cors-misconfigurations-for-bitcoins-and-bounties\" rel=\"noopener noreferrer\" target=\"_blank\">PortSwigger: Exploiting CORS misconfiguration</a></li><li><a href=\"https://www.oauth.com/oauth2-servers/listing-authorizations/revoking-access/\" rel=\"noopener noreferrer\" target=\"_blank\">OAuth: Revoking Access</a></li></ul><h2></h2><h2>List of Mapped CWEs</h2><p><a href=\"https://cwe.mitre.org/data/definitions/22.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-22 Improper Limitation of a Pathname to a Restricted Directory ('Path Traversal')</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/23.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-23 Relative Path Traversal</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/35.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-35 Path Traversal: '.../...//'</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/59.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-59 Improper Link Resolution Before File Access ('Link Following')</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/200.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-200 Exposure of Sensitive Information to an Unauthorized Actor</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/201.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-201 Exposure of Sensitive Information Through Sent Data</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/219.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-219 Storage of File with Sensitive Data Under Web Root</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/264.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-264 Permissions, Privileges, and Access Controls (should no longer be used)</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/275.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-275 Permission Issues</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/276.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-276 Incorrect Default Permissions</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/284.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-284 Improper Access Control</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/285.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-285 Improper Authorization</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/352.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-352 Cross-Site Request Forgery (CSRF)</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/359.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-359 Exposure of Private Personal Information to an Unauthorized Actor</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/377.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-377 Insecure Temporary File</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/402.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-402 Transmission of Private Resources into a New Sphere ('Resource Leak')</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/425.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-425 Direct Request ('Forced Browsing')</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/441.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-441 Unintended Proxy or Intermediary ('Confused Deputy')</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/497.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-497 Exposure of Sensitive System Information to an Unauthorized Control Sphere</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/538.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-538 Insertion of Sensitive Information into Externally-Accessible File or Directory</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/540.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-540 Inclusion of Sensitive Information in Source Code</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/548.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-548 Exposure of Information Through Directory Listing</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/552.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-552 Files or Directories Accessible to External Parties</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/566.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-566 Authorization Bypass Through User-Controlled SQL Primary Key</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/601.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-601 URL Redirection to Untrusted Site ('Open Redirect')</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/639.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-639 Authorization Bypass Through User-Controlled Key</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/651.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-651 Exposure of WSDL File Containing Sensitive Information</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/668.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-668 Exposure of Resource to Wrong Sphere</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/706.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-706 Use of Incorrectly-Resolved Name or Reference</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/862.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-862 Missing Authorization</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/863.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-863 Incorrect Authorization</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/913.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-913 Improper Control of Dynamically-Managed Code Resources</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/922.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-922 Insecure Storage of Sensitive Information</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/1275.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-1275 Sensitive Cookie with Improper SameSite Attribute</a></p>",
        "code": "A01:2021",
        "sort_order": 1
    },
    {
        "tags":
        [
            "A02:2021 – Cryptographic Failures"
        ],
        "testcase": "Cryptographic Failures",
        "details": "<h2>Factors</h2><table style=\"width:997.312px;\"><tbody><tr><td><p><strong>CWEs Mapped</strong></p></td><td><p><strong>Max Incidence Rate</strong></p></td><td><p><strong>Avg Incidence Rate</strong></p></td><td><p><strong>Avg Weighted Exploit</strong></p></td><td><p><strong>Avg Weighted Impact</strong></p></td><td><p><strong>Max Coverage</strong></p></td><td><p><strong>Avg Coverage</strong></p></td><td><p><strong>Total Occurrences</strong></p></td><td><p><strong>Total CVEs</strong></p></td></tr><tr><td><p>29</p></td><td><p>46.44%</p></td><td><p>4.49%</p></td><td><p>7.29</p></td><td><p>6.81</p></td><td><p>79.33%</p></td><td><p>34.85%</p></td><td><p>233,788</p></td><td><p>3,075</p></td></tr></tbody></table><h2></h2><h2>Overview</h2><p>Shifting up one position to #2, previously known as <em>Sensitive Data Exposure</em>, which is more of a broad symptom rather than a root cause, the focus is on failures related to cryptography (or lack thereof). Which often lead to exposure of sensitive data. Notable Common Weakness Enumerations (CWEs) included are <em>CWE-259: Use of Hard-coded Password</em>, <em>CWE-327: Broken or Risky Crypto Algorithm</em>, and <em>CWE-331 Insufficient Entropy</em>.</p><h2></h2><h2>Description</h2><p>The first thing is to determine the protection needs of data in transit and at rest. For example, passwords, credit card numbers, health records, personal information, and business secrets require extra protection, mainly if that data falls under privacy laws, e.g., EU's General Data Protection Regulation (GDPR), or regulations, e.g., financial data protection such as PCI Data Security Standard (PCI DSS). For all such data:</p><ul><li>Is any data transmitted in clear text? This concerns protocols such as HTTP, SMTP, FTP also using TLS upgrades like STARTTLS. External internet traffic is hazardous. Verify all internal traffic, e.g., between load balancers, web servers, or back-end systems.</li><li>Are any old or weak cryptographic algorithms or protocols used either by default or in older code?</li><li>Are default crypto keys in use, weak crypto keys generated or re-used, or is proper key management or rotation missing? Are crypto keys checked into source code repositories?</li><li>Is encryption not enforced, e.g., are any HTTP headers (browser) security directives or headers missing?</li><li>Is the received server certificate and the trust chain properly validated?</li><li>Are initialization vectors ignored, reused, or not generated sufficiently secure for the cryptographic mode of operation? Is an insecure mode of operation such as ECB in use? Is encryption used when authenticated encryption is more appropriate?</li><li>Are passwords being used as cryptographic keys in absence of a password base key derivation function?</li><li>Is randomness used for cryptographic purposes that was not designed to meet cryptographic requirements? Even if the correct function is chosen, does it need to be seeded by the developer, and if not, has the developer over-written the strong seeding functionality built into it with a seed that lacks sufficient entropy/unpredictability?</li><li>Are deprecated hash functions such as MD5 or SHA1 in use, or are non-cryptographic hash functions used when cryptographic hash functions are needed?</li><li>Are deprecated cryptographic padding methods such as PKCS number 1 v1.5 in use?</li><li>Are cryptographic error messages or side channel information exploitable, for example in the form of padding oracle attacks?</li></ul><p>See ASVS Crypto (V7), Data Protection (V9), and SSL/TLS (V10)</p><h2></h2><h2>How to Prevent</h2><p>Do the following, at a minimum, and consult the references:</p><ul><li>Classify data processed, stored, or transmitted by an application. Identify which data is sensitive according to privacy laws, regulatory requirements, or business needs.</li><li>Don't store sensitive data unnecessarily. Discard it as soon as possible or use PCI DSS compliant tokenization or even truncation. Data that is not retained cannot be stolen.</li><li>Make sure to encrypt all sensitive data at rest.</li><li>Ensure up-to-date and strong standard algorithms, protocols, and keys are in place; use proper key management.</li><li>Encrypt all data in transit with secure protocols such as TLS with forward secrecy (FS) ciphers, cipher prioritization by the server, and secure parameters. Enforce encryption using directives like HTTP Strict Transport Security (HSTS).</li><li>Disable caching for response that contain sensitive data.</li><li>Apply required security controls as per the data classification.</li><li>Do not use legacy protocols such as FTP and SMTP for transporting sensitive data.</li><li>Store passwords using strong adaptive and salted hashing functions with a work factor (delay factor), such as Argon2, scrypt, bcrypt or PBKDF2.</li><li>Initialization vectors must be chosen appropriate for the mode of operation. For many modes, this means using a CSPRNG (cryptographically secure pseudo random number generator). For modes that require a nonce, then the initialization vector (IV) does not need a CSPRNG. In all cases, the IV should never be used twice for a fixed key.</li><li>Always use authenticated encryption instead of just encryption.</li><li>Keys should be generated cryptographically randomly and stored in memory as byte arrays. If a password is used, then it must be converted to a key via an appropriate password base key derivation function.</li><li>Ensure that cryptographic randomness is used where appropriate, and that it has not been seeded in a predictable way or with low entropy. Most modern APIs do not require the developer to seed the CSPRNG to get security.</li><li>Avoid deprecated cryptographic functions and padding schemes, such as MD5, SHA1, PKCS number 1 v1.5.</li><li>Verify independently the effectiveness of configuration and settings.</li></ul><h2></h2><h2>Example Attack Scenarios</h2><p><strong>Scenario #1</strong>: An application encrypts credit card numbers in a database using automatic database encryption. However, this data is automatically decrypted when retrieved, allowing a SQL injection flaw to retrieve credit card numbers in clear text.</p><p><strong>Scenario #2</strong>: A site doesn't use or enforce TLS for all pages or supports weak encryption. An attacker monitors network traffic (e.g., at an insecure wireless network), downgrades connections from HTTPS to HTTP, intercepts requests, and steals the user's session cookie. The attacker then replays this cookie and hijacks the user's (authenticated) session, accessing or modifying the user's private data. Instead of the above they could alter all transported data, e.g., the recipient of a money transfer.</p><p><strong>Scenario #3</strong>: The password database uses unsalted or simple hashes to store everyone's passwords. A file upload flaw allows an attacker to retrieve the password database. All the unsalted hashes can be exposed with a rainbow table of pre-calculated hashes. Hashes generated by simple or fast hash functions may be cracked by GPUs, even if they were salted.</p><h2></h2><h2>References</h2><ul><li><a href=\"https://owasp.org/www-project-proactive-controls/v3/en/c8-protect-data-everywhere\" rel=\"noopener noreferrer\" target=\"_blank\">OWASP Proactive Controls: Protect Data Everywhere</a></li><li><a href=\"https://owasp.org/www-project-application-security-verification-standard\" rel=\"noopener noreferrer\" target=\"_blank\">OWASP Application Security Verification Standard (V7, 9, 10)</a></li><li><a href=\"https://cheatsheetseries.owasp.org/cheatsheets/Transport_Layer_Protection_Cheat_Sheet.html\" rel=\"noopener noreferrer\" target=\"_blank\">OWASP Cheat Sheet: Transport Layer Protection</a></li><li><a href=\"https://cheatsheetseries.owasp.org/cheatsheets/User_Privacy_Protection_Cheat_Sheet.html\" rel=\"noopener noreferrer\" target=\"_blank\">OWASP Cheat Sheet: User Privacy Protection</a></li><li><a href=\"https://cheatsheetseries.owasp.org/cheatsheets/Password_Storage_Cheat_Sheet.html\" rel=\"noopener noreferrer\" target=\"_blank\">OWASP Cheat Sheet: Password Storage</a></li><li><a href=\"https://cheatsheetseries.owasp.org/cheatsheets/Cryptographic_Storage_Cheat_Sheet.html\" rel=\"noopener noreferrer\" target=\"_blank\">OWASP Cheat Sheet: Cryptographic Storage</a></li><li><a href=\"https://cheatsheetseries.owasp.org/cheatsheets/HTTP_Strict_Transport_Security_Cheat_Sheet.html\" rel=\"noopener noreferrer\" target=\"_blank\">OWASP Cheat Sheet: HSTS</a></li><li><a href=\"https://owasp.org/www-project-web-security-testing-guide/stable/4-Web_Application_Security_Testing/09-Testing_for_Weak_Cryptography/README\" rel=\"noopener noreferrer\" target=\"_blank\">OWASP Testing Guide: Testing for weak cryptography</a></li></ul><h2></h2><h2>List of Mapped CWEs</h2><p><a href=\"https://cwe.mitre.org/data/definitions/259.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-259 Use of Hard-coded Password</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/261.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-261 Weak Encoding for Password</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/296.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-296 Improper Following of a Certificate's Chain of Trust</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/310.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-310 Cryptographic Issues</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/319.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-319 Cleartext Transmission of Sensitive Information</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/321.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-321 Use of Hard-coded Cryptographic Key</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/322.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-322 Key Exchange without Entity Authentication</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/323.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-323 Reusing a Nonce, Key Pair in Encryption</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/324.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-324 Use of a Key Past its Expiration Date</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/325.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-325 Missing Required Cryptographic Step</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/326.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-326 Inadequate Encryption Strength</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/327.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-327 Use of a Broken or Risky Cryptographic Algorithm</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/328.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-328 Reversible One-Way Hash</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/329.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-329 Not Using a Random IV with CBC Mode</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/330.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-330 Use of Insufficiently Random Values</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/331.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-331 Insufficient Entropy</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/335.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-335 Incorrect Usage of Seeds in Pseudo-Random Number Generator(PRNG)</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/336.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-336 Same Seed in Pseudo-Random Number Generator (PRNG)</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/337.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-337 Predictable Seed in Pseudo-Random Number Generator (PRNG)</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/338.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-338 Use of Cryptographically Weak Pseudo-Random Number Generator(PRNG)</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/340.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-340 Generation of Predictable Numbers or Identifiers</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/347.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-347 Improper Verification of Cryptographic Signature</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/523.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-523 Unprotected Transport of Credentials</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/720.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-720 OWASP Top Ten 2007 Category A9 - Insecure Communications</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/757.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-757 Selection of Less-Secure Algorithm During Negotiation('Algorithm Downgrade')</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/759.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-759 Use of a One-Way Hash without a Salt</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/760.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-760 Use of a One-Way Hash with a Predictable Salt</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/780.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-780 Use of RSA Algorithm without OAEP</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/818.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-818 Insufficient Transport Layer Protection</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/916.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-916 Use of Password Hash With Insufficient Computational Effort</a></p>",
        "code": "A02:2021",
        "sort_order": 2
    },
    {
        "tags":
        [
            "A03:2021 – Injection"
        ],
        "testcase": "Injection",
        "details": "<h2>Factors</h2><table style=\"width:997.312px;\"><tbody><tr><td><p><strong>CWEs Mapped</strong></p></td><td><p><strong>Max Incidence Rate</strong></p></td><td><p><strong>Avg Incidence Rate</strong></p></td><td><p><strong>Avg Weighted Exploit</strong></p></td><td><p><strong>Avg Weighted Impact</strong></p></td><td><p><strong>Max Coverage</strong></p></td><td><p><strong>Avg Coverage</strong></p></td><td><p><strong>Total Occurrences</strong></p></td><td><p><strong>Total CVEs</strong></p></td></tr><tr><td><p>33</p></td><td><p>19.09%</p></td><td><p>3.37%</p></td><td><p>7.25</p></td><td><p>7.15</p></td><td><p>94.04%</p></td><td><p>47.90%</p></td><td><p>274,228</p></td><td><p>32,078</p></td></tr></tbody></table><h2></h2><h2>Overview</h2><p>Injection slides down to the third position. 94% of the applications were tested for some form of injection with a max incidence rate of 19%, an average incidence rate of 3%, and 274k occurrences. Notable Common Weakness Enumerations (CWEs) included are <em>CWE-79: Cross-site Scripting</em>, <em>CWE-89: SQL Injection</em>, and <em>CWE-73: External Control of File Name or Path</em>.</p><h2></h2><h2>Description</h2><p>An application is vulnerable to attack when:</p><ul><li>User-supplied data is not validated, filtered, or sanitized by the application.</li><li>Dynamic queries or non-parameterized calls without context-aware escaping are used directly in the interpreter.</li><li>Hostile data is used within object-relational mapping (ORM) search parameters to extract additional, sensitive records.</li><li>Hostile data is directly used or concatenated. The SQL or command contains the structure and malicious data in dynamic queries, commands, or stored procedures.</li></ul><p>Some of the more common injections are SQL, NoSQL, OS command, Object Relational Mapping (ORM), LDAP, and Expression Language (EL) or Object Graph Navigation Library (OGNL) injection. The concept is identical among all interpreters. Source code review is the best method of detecting if applications are vulnerable to injections. Automated testing of all parameters, headers, URL, cookies, JSON, SOAP, and XML data inputs is strongly encouraged. Organizations can include static (SAST), dynamic (DAST), and interactive (IAST) application security testing tools into the CI/CD pipeline to identify introduced injection flaws before production deployment.</p><h2></h2><h2>How to Prevent</h2><p>Preventing injection requires keeping data separate from commands and queries:</p><ul><li>The preferred option is to use a safe API, which avoids using the interpreter entirely, provides a parameterized interface, or migrates to Object Relational Mapping Tools (ORMs).</li><li><strong>Note:</strong> Even when parameterized, stored procedures can still introduce SQL injection if PL/SQL or T-SQL concatenates queries and data or executes hostile data with EXECUTE IMMEDIATE or exec().</li><li>Use positive server-side input validation. This is not a complete defense as many applications require special characters, such as text areas or APIs for mobile applications.</li><li>For any residual dynamic queries, escape special characters using the specific escape syntax for that interpreter.</li><li><strong>Note:</strong> SQL structures such as table names, column names, and so on cannot be escaped, and thus user-supplied structure names are dangerous. This is a common issue in report-writing software.</li></ul><h2></h2><h2>Example Attack Scenarios</h2><p><strong>Scenario #1:</strong> An application uses untrusted data in the construction of the following vulnerable SQL call:</p><pre>String query = \"SELECT \\* FROM accounts WHERE custID='\" + request.getParameter(\"id\") + \"'\";\n</pre><p><strong>Scenario #2:</strong> Similarly, an application’s blind trust in frameworks may result in queries that are still vulnerable, (e.g., Hibernate Query Language (HQL)):</p><pre> Query HQLQuery = session.createQuery(\"FROM accounts WHERE custID='\" + request.getParameter(\"id\") + \"'\");\n</pre><p>In both cases, the attacker modifies the ‘id’ parameter value in their browser to send: ' UNION SLEEP(10);--. For example:</p><pre> http://example.com/app/accountView?id=' UNION SELECT SLEEP(10);--\n</pre><p>This changes the meaning of both queries to return all the records from the accounts table. More dangerous attacks could modify or delete data or even invoke stored procedures.</p><h2></h2><h2>References</h2><ul><li><a href=\"https://owasp.org/www-project-proactive-controls/v3/en/c3-secure-database\" rel=\"noopener noreferrer\" target=\"_blank\">OWASP Proactive Controls: Secure Database Access</a></li><li><a href=\"https://owasp.org/www-project-application-security-verification-standard\" rel=\"noopener noreferrer\" target=\"_blank\">OWASP ASVS: V5 Input Validation and Encoding</a></li><li><a href=\"https://owasp.org/www-project-web-security-testing-guide/latest/4-Web_Application_Security_Testing/07-Input_Validation_Testing/05-Testing_for_SQL_Injection\" rel=\"noopener noreferrer\" target=\"_blank\">OWASP Testing Guide: SQL Injection,</a> <a href=\"https://owasp.org/www-project-web-security-testing-guide/latest/4-Web_Application_Security_Testing/07-Input_Validation_Testing/12-Testing_for_Command_Injection\" rel=\"noopener noreferrer\" target=\"_blank\">Command Injection</a>, and <a href=\"https://owasp.org/www-project-web-security-testing-guide/latest/4-Web_Application_Security_Testing/07-Input_Validation_Testing/05.7-Testing_for_ORM_Injection\" rel=\"noopener noreferrer\" target=\"_blank\">ORM Injection</a></li><li><a href=\"https://cheatsheetseries.owasp.org/cheatsheets/Injection_Prevention_Cheat_Sheet.html\" rel=\"noopener noreferrer\" target=\"_blank\">OWASP Cheat Sheet: Injection Prevention</a></li><li><a href=\"https://cheatsheetseries.owasp.org/cheatsheets/SQL_Injection_Prevention_Cheat_Sheet.html\" rel=\"noopener noreferrer\" target=\"_blank\">OWASP Cheat Sheet: SQL Injection Prevention</a></li><li><a href=\"https://cheatsheetseries.owasp.org/cheatsheets/Injection_Prevention_Cheat_Sheet_in_Java.html\" rel=\"noopener noreferrer\" target=\"_blank\">OWASP Cheat Sheet: Injection Prevention in Java</a></li><li><a href=\"https://cheatsheetseries.owasp.org/cheatsheets/Query_Parameterization_Cheat_Sheet.html\" rel=\"noopener noreferrer\" target=\"_blank\">OWASP Cheat Sheet: Query Parameterization</a></li><li><a href=\"https://owasp.org/www-project-automated-threats-to-web-applications/\" rel=\"noopener noreferrer\" target=\"_blank\">OWASP Automated Threats to Web Applications – OAT-014</a></li><li><a href=\"https://portswigger.net/kb/issues/00101080_serversidetemplateinjection\" rel=\"noopener noreferrer\" target=\"_blank\">PortSwigger: Server-side template injection</a></li></ul><h2></h2><h2>List of Mapped CWEs</h2><p><a href=\"https://cwe.mitre.org/data/definitions/20.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-20 Improper Input Validation</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/74.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-74 Improper Neutralization of Special Elements in Output Used by a Downstream Component ('Injection')</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/75.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-75 Failure to Sanitize Special Elements into a Different Plane (Special Element Injection)</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/77.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-77 Improper Neutralization of Special Elements used in a Command ('Command Injection')</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/78.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-78 Improper Neutralization of Special Elements used in an OS Command ('OS Command Injection')</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/79.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-79 Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting')</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/80.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-80 Improper Neutralization of Script-Related HTML Tags in a Web Page (Basic XSS)</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/83.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-83 Improper Neutralization of Script in Attributes in a Web Page</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/87.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-87 Improper Neutralization of Alternate XSS Syntax</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/88.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-88 Improper Neutralization of Argument Delimiters in a Command ('Argument Injection')</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/89.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-89 Improper Neutralization of Special Elements used in an SQL Command ('SQL Injection')</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/90.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-90 Improper Neutralization of Special Elements used in an LDAP Query ('LDAP Injection')</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/91.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-91 XML Injection (aka Blind XPath Injection)</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/93.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-93 Improper Neutralization of CRLF Sequences ('CRLF Injection')</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/94.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-94 Improper Control of Generation of Code ('Code Injection')</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/95.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-95 Improper Neutralization of Directives in Dynamically Evaluated Code ('Eval Injection')</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/96.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-96 Improper Neutralization of Directives in Statically Saved Code ('Static Code Injection')</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/97.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-97 Improper Neutralization of Server-Side Includes (SSI) Within a Web Page</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/98.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-98 Improper Control of Filename for Include/Require Statement in PHP Program ('PHP Remote File Inclusion')</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/99.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-99 Improper Control of Resource Identifiers ('Resource Injection')</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/100.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-100 Deprecated: Was catch-all for input validation issues</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/113.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-113 Improper Neutralization of CRLF Sequences in HTTP Headers ('HTTP Response Splitting')</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/116.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-116 Improper Encoding or Escaping of Output</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/138.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-138 Improper Neutralization of Special Elements</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/184.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-184 Incomplete List of Disallowed Inputs</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/470.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-470 Use of Externally-Controlled Input to Select Classes or Code ('Unsafe Reflection')</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/471.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-471 Modification of Assumed-Immutable Data (MAID)</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/564.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-564 SQL Injection: Hibernate</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/610.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-610 Externally Controlled Reference to a Resource in Another Sphere</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/643.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-643 Improper Neutralization of Data within XPath Expressions ('XPath Injection')</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/644.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-644 Improper Neutralization of HTTP Headers for Scripting Syntax</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/652.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-652 Improper Neutralization of Data within XQuery Expressions ('XQuery Injection')</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/917.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-917 Improper Neutralization of Special Elements used in an Expression Language Statement ('Expression Language Injection')</a></p>",
        "code": "A03:2021",
        "sort_order": 3
    },
    {
        "tags":
        [
            "A04:2021 – Insecure Design"
        ],
        "testcase": "Insecure Design",
        "details": "<h2>Factors</h2><table style=\"width:997.312px;\"><tbody><tr><td><p><strong>CWEs Mapped</strong></p></td><td><p><strong>Max Incidence Rate</strong></p></td><td><p><strong>Avg Incidence Rate</strong></p></td><td><p><strong>Avg Weighted Exploit</strong></p></td><td><p><strong>Avg Weighted Impact</strong></p></td><td><p><strong>Max Coverage</strong></p></td><td><p><strong>Avg Coverage</strong></p></td><td><p><strong>Total Occurrences</strong></p></td><td><p><strong>Total CVEs</strong></p></td></tr><tr><td><p>40</p></td><td><p>24.19%</p></td><td><p>3.00%</p></td><td><p>6.46</p></td><td><p>6.78</p></td><td><p>77.25%</p></td><td><p>42.51%</p></td><td><p>262,407</p></td><td><p>2,691</p></td></tr></tbody></table><h2></h2><h2>Overview</h2><p>A new category for 2021 focuses on risks related to design and architectural flaws, with a call for more use of threat modeling, secure design patterns, and reference architectures. As a community we need to move beyond \"shift-left\" in the coding space to pre-code activities that are critical for the principles of Secure by Design. Notable Common Weakness Enumerations (CWEs) include <em>CWE-209: Generation of Error Message Containing Sensitive Information</em>, <em>CWE-256: Unprotected Storage of Credentials</em>, <em>CWE-501: Trust Boundary Violation</em>, and <em>CWE-522: Insufficiently Protected Credentials</em>.</p><h2></h2><h2>Description</h2><p>Insecure design is a broad category representing different weaknesses, expressed as “missing or ineffective control design.” Insecure design is not the source for all other Top 10 risk categories. There is a difference between insecure design and insecure implementation. We differentiate between design flaws and implementation defects for a reason, they have different root causes and remediation. A secure design can still have implementation defects leading to vulnerabilities that may be exploited. An insecure design cannot be fixed by a perfect implementation as by definition, needed security controls were never created to defend against specific attacks. One of the factors that contribute to insecure design is the lack of business risk profiling inherent in the software or system being developed, and thus the failure to determine what level of security design is required.</p><h3>Requirements and Resource Management</h3><p>Collect and negotiate the business requirements for an application with the business, including the protection requirements concerning confidentiality, integrity, availability, and authenticity of all data assets and the expected business logic. Take into account how exposed your application will be and if you need segregation of tenants (additionally to access control). Compile the technical requirements, including functional and non-functional security requirements. Plan and negotiate the budget covering all design, build, testing, and operation, including security activities.</p><h3>Secure Design</h3><p>Secure design is a culture and methodology that constantly evaluates threats and ensures that code is robustly designed and tested to prevent known attack methods. Threat modeling should be integrated into refinement sessions (or similar activities); look for changes in data flows and access control or other security controls. In the user story development determine the correct flow and failure states, ensure they are well understood and agreed upon by responsible and impacted parties. Analyze assumptions and conditions for expected and failure flows, ensure they are still accurate and desirable. Determine how to validate the assumptions and enforce conditions needed for proper behaviors. Ensure the results are documented in the user story. Learn from mistakes and offer positive incentives to promote improvements. Secure design is neither an add-on nor a tool that you can add to software.</p><h3>Secure Development Lifecycle</h3><p>Secure software requires a secure development lifecycle, some form of secure design pattern, paved road methodology, secured component library, tooling, and threat modeling. Reach out for your security specialists at the beginning of a software project throughout the whole project and maintenance of your software. Consider leveraging the <a href=\"https://owaspsamm.org/\" rel=\"noopener noreferrer\" target=\"_blank\">OWASP Software Assurance Maturity Model (SAMM)</a> to help structure your secure software development efforts.</p><h2></h2><h2>How to Prevent</h2><ul><li>Establish and use a secure development lifecycle with AppSec professionals to help evaluate and design security and privacy-related controls</li><li>Establish and use a library of secure design patterns or paved road ready to use components</li><li>Use threat modeling for critical authentication, access control, business logic, and key flows</li><li>Integrate security language and controls into user stories</li><li>Integrate plausibility checks at each tier of your application (from frontend to backend)</li><li>Write unit and integration tests to validate that all critical flows are resistant to the threat model. Compile use-cases <em>and</em> misuse-cases for each tier of your application.</li><li>Segregate tier layers on the system and network layers depending on the exposure and protection needs</li><li>Segregate tenants robustly by design throughout all tiers</li><li>Limit resource consumption by user or service</li></ul><h2></h2><h2>Example Attack Scenarios</h2><p><strong>Scenario #1:</strong> A credential recovery workflow might include “questions and answers,” which is prohibited by NIST 800-63b, the OWASP ASVS, and the OWASP Top 10. Questions and answers cannot be trusted as evidence of identity as more than one person can know the answers, which is why they are prohibited. Such code should be removed and replaced with a more secure design.</p><p><strong>Scenario #2:</strong> A cinema chain allows group booking discounts and has a maximum of fifteen attendees before requiring a deposit. Attackers could threat model this flow and test if they could book six hundred seats and all cinemas at once in a few requests, causing a massive loss of income.</p><p><strong>Scenario #3:</strong> A retail chain’s e-commerce website does not have protection against bots run by scalpers buying high-end video cards to resell auction websites. This creates terrible publicity for the video card makers and retail chain owners and enduring bad blood with enthusiasts who cannot obtain these cards at any price. Careful anti-bot design and domain logic rules, such as purchases made within a few seconds of availability, might identify inauthentic purchases and rejected such transactions.</p><h2></h2><h2>References</h2><ul><li><a href=\"https://cheatsheetseries.owasp.org/cheatsheets/Secure_Product_Design_Cheat_Sheet.html\" rel=\"noopener noreferrer\" target=\"_blank\">OWASP Cheat Sheet: Secure Design Principles</a></li><li><a href=\"https://owaspsamm.org/model/design/security-architecture/\" rel=\"noopener noreferrer\" target=\"_blank\">OWASP SAMM: Design:Security Architecture</a></li><li><a href=\"https://owaspsamm.org/model/design/threat-assessment/\" rel=\"noopener noreferrer\" target=\"_blank\">OWASP SAMM: Design:Threat Assessment</a></li><li><a href=\"https://www.nist.gov/publications/guidelines-minimum-standards-developer-verification-software\" rel=\"noopener noreferrer\" target=\"_blank\">NIST – Guidelines on Minimum Standards for Developer Verification of Software</a></li><li><a href=\"https://threatmodelingmanifesto.org/\" rel=\"noopener noreferrer\" target=\"_blank\">The Threat Modeling Manifesto</a></li><li><a href=\"https://github.com/hysnsec/awesome-threat-modelling\" rel=\"noopener noreferrer\" target=\"_blank\">Awesome Threat Modeling</a></li></ul><h2></h2><h2>List of Mapped CWEs</h2><p><a href=\"https://cwe.mitre.org/data/definitions/73.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-73 External Control of File Name or Path</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/183.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-183 Permissive List of Allowed Inputs</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/209.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-209 Generation of Error Message Containing Sensitive Information</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/213.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-213 Exposure of Sensitive Information Due to Incompatible Policies</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/235.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-235 Improper Handling of Extra Parameters</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/256.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-256 Unprotected Storage of Credentials</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/257.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-257 Storing Passwords in a Recoverable Format</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/266.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-266 Incorrect Privilege Assignment</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/269.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-269 Improper Privilege Management</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/280.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-280 Improper Handling of Insufficient Permissions or Privileges</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/311.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-311 Missing Encryption of Sensitive Data</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/312.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-312 Cleartext Storage of Sensitive Information</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/313.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-313 Cleartext Storage in a File or on Disk</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/316.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-316 Cleartext Storage of Sensitive Information in Memory</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/419.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-419 Unprotected Primary Channel</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/430.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-430 Deployment of Wrong Handler</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/434.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-434 Unrestricted Upload of File with Dangerous Type</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/444.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-444 Inconsistent Interpretation of HTTP Requests ('HTTP Request Smuggling')</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/451.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-451 User Interface (UI) Misrepresentation of Critical Information</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/472.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-472 External Control of Assumed-Immutable Web Parameter</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/501.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-501 Trust Boundary Violation</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/522.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-522 Insufficiently Protected Credentials</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/525.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-525 Use of Web Browser Cache Containing Sensitive Information</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/539.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-539 Use of Persistent Cookies Containing Sensitive Information</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/579.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-579 J2EE Bad Practices: Non-serializable Object Stored in Session</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/598.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-598 Use of GET Request Method With Sensitive Query Strings</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/602.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-602 Client-Side Enforcement of Server-Side Security</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/642.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-642 External Control of Critical State Data</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/646.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-646 Reliance on File Name or Extension of Externally-Supplied File</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/650.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-650 Trusting HTTP Permission Methods on the Server Side</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/653.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-653 Insufficient Compartmentalization</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/656.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-656 Reliance on Security Through Obscurity</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/657.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-657 Violation of Secure Design Principles</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/799.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-799 Improper Control of Interaction Frequency</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/807.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-807 Reliance on Untrusted Inputs in a Security Decision</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/840.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-840 Business Logic Errors</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/841.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-841 Improper Enforcement of Behavioral Workflow</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/927.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-927 Use of Implicit Intent for Sensitive Communication</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/1021.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-1021 Improper Restriction of Rendered UI Layers or Frames</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/1173.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-1173 Improper Use of Validation Framework</a></p>",
        "code": "A04:2021",
        "sort_order": 4
    },
    {
        "tags":
        [
            "A05:2021 – Security Misconfiguration"
        ],
        "testcase": "Security Misconfiguration",
        "details": "<h2>Factors</h2><table style=\"width:997.312px;\"><tbody><tr><td><p><strong>CWEs Mapped</strong></p></td><td><p><strong>Max Incidence Rate</strong></p></td><td><p><strong>Avg Incidence Rate</strong></p></td><td><p><strong>Avg Weighted Exploit</strong></p></td><td><p><strong>Avg Weighted Impact</strong></p></td><td><p><strong>Max Coverage</strong></p></td><td><p><strong>Avg Coverage</strong></p></td><td><p><strong>Total Occurrences</strong></p></td><td><p><strong>Total CVEs</strong></p></td></tr><tr><td><p>20</p></td><td><p>19.84%</p></td><td><p>4.51%</p></td><td><p>8.12</p></td><td><p>6.56</p></td><td><p>89.58%</p></td><td><p>44.84%</p></td><td><p>208,387</p></td><td><p>789</p></td></tr></tbody></table><h2></h2><h2>Overview</h2><p>Moving up from #6 in the previous edition, 90% of applications were tested for some form of misconfiguration, with an average incidence rate of 4.51%, and over 208k occurrences of a Common Weakness Enumeration (CWE) in this risk category. With more shifts into highly configurable software, it's not surprising to see this category move up. Notable CWEs included are <em>CWE-16 Configuration</em> and <em>CWE-611 Improper Restriction of XML External Entity Reference</em>.</p><h2></h2><h2>Description</h2><p>The application might be vulnerable if the application is:</p><ul><li>Missing appropriate security hardening across any part of the application stack or improperly configured permissions on cloud services.</li><li>Unnecessary features are enabled or installed (e.g., unnecessary ports, services, pages, accounts, or privileges).</li><li>Default accounts and their passwords are still enabled and unchanged.</li><li>Error handling reveals stack traces or other overly informative error messages to users.</li><li>For upgraded systems, the latest security features are disabled or not configured securely.</li><li>The security settings in the application servers, application frameworks (e.g., Struts, Spring, ASP.NET), libraries, databases, etc., are not set to secure values.</li><li>The server does not send security headers or directives, or they are not set to secure values.</li><li>The software is out of date or vulnerable (see <a href=\"https://owasp.org/Top10/A06_2021-Vulnerable_and_Outdated_Components/\" rel=\"noopener noreferrer\" target=\"_blank\">A06:2021-Vulnerable and Outdated Components</a>).</li></ul><p>Without a concerted, repeatable application security configuration process, systems are at a higher risk.</p><h2></h2><h2>How to Prevent</h2><p>Secure installation processes should be implemented, including:</p><ul><li>A repeatable hardening process makes it fast and easy to deploy another environment that is appropriately locked down. Development, QA, and production environments should all be configured identically, with different credentials used in each environment. This process should be automated to minimize the effort required to set up a new secure environment.</li><li>A minimal platform without any unnecessary features, components, documentation, and samples. Remove or do not install unused features and frameworks.</li><li>A task to review and update the configurations appropriate to all security notes, updates, and patches as part of the patch management process (see <a href=\"https://owasp.org/Top10/A06_2021-Vulnerable_and_Outdated_Components/\" rel=\"noopener noreferrer\" target=\"_blank\">A06:2021-Vulnerable and Outdated Components</a>). Review cloud storage permissions (e.g., S3 bucket permissions).</li><li>A segmented application architecture provides effective and secure separation between components or tenants, with segmentation, containerization, or cloud security groups (ACLs).</li><li>Sending security directives to clients, e.g., Security Headers.</li><li>An automated process to verify the effectiveness of the configurations and settings in all environments.</li></ul><h2></h2><h2>Example Attack Scenarios</h2><p><strong>Scenario #1:</strong> The application server comes with sample applications not removed from the production server. These sample applications have known security flaws attackers use to compromise the server. Suppose one of these applications is the admin console, and default accounts weren't changed. In that case, the attacker logs in with default passwords and takes over.</p><p><strong>Scenario #2:</strong> Directory listing is not disabled on the server. An attacker discovers they can simply list directories. The attacker finds and downloads the compiled Java classes, which they decompile and reverse engineer to view the code. The attacker then finds a severe access control flaw in the application.</p><p><strong>Scenario #3:</strong> The application server's configuration allows detailed error messages, e.g., stack traces, to be returned to users. This potentially exposes sensitive information or underlying flaws such as component versions that are known to be vulnerable.</p><p><strong>Scenario #4:</strong> A cloud service provider (CSP) has default sharing permissions open to the Internet by other CSP users. This allows sensitive data stored within cloud storage to be accessed.</p><h2></h2><h2>References</h2><ul><li><a href=\"https://owasp.org/www-project-web-security-testing-guide/latest/4-Web_Application_Security_Testing/02-Configuration_and_Deployment_Management_Testing/README\" rel=\"noopener noreferrer\" target=\"_blank\">OWASP Testing Guide: Configuration Management</a></li><li><a href=\"https://owasp.org/www-project-web-security-testing-guide/stable/4-Web_Application_Security_Testing/08-Testing_for_Error_Handling/01-Testing_For_Improper_Error_Handling\" rel=\"noopener noreferrer\" target=\"_blank\">OWASP Testing Guide: Testing for Error Codes</a></li><li><a href=\"https://github.com/OWASP/ASVS/blob/master/4.0/en/0x22-V14-Config.md\" rel=\"noopener noreferrer\" target=\"_blank\">Application Security Verification Standard V14 Configuration</a></li><li><a href=\"https://csrc.nist.gov/publications/detail/sp/800-123/final\" rel=\"noopener noreferrer\" target=\"_blank\">NIST Guide to General Server Hardening</a></li><li><a href=\"https://www.cisecurity.org/cis-benchmarks/\" rel=\"noopener noreferrer\" target=\"_blank\">CIS Security Configuration Guides/Benchmarks</a></li><li><a href=\"https://blog.websecurify.com/2017/10/aws-s3-bucket-discovery.html\" rel=\"noopener noreferrer\" target=\"_blank\">Amazon S3 Bucket Discovery and Enumeration</a></li></ul><h2></h2><h2>List of Mapped CWEs</h2><p><a href=\"https://cwe.mitre.org/data/definitions/2.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-2 7PK - Environment</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/11.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-11 ASP.NET Misconfiguration: Creating Debug Binary</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/13.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-13 ASP.NET Misconfiguration: Password in Configuration File</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/15.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-15 External Control of System or Configuration Setting</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/16.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-16 Configuration</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/260.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-260 Password in Configuration File</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/315.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-315 Cleartext Storage of Sensitive Information in a Cookie</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/520.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-520 .NET Misconfiguration: Use of Impersonation</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/526.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-526 Exposure of Sensitive Information Through Environmental Variables</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/537.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-537 Java Runtime Error Message Containing Sensitive Information</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/541.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-541 Inclusion of Sensitive Information in an Include File</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/547.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-547 Use of Hard-coded, Security-relevant Constants</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/611.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-611 Improper Restriction of XML External Entity Reference</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/614.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-614 Sensitive Cookie in HTTPS Session Without 'Secure' Attribute</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/756.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-756 Missing Custom Error Page</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/776.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-776 Improper Restriction of Recursive Entity References in DTDs ('XML Entity Expansion')</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/942.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-942 Permissive Cross-domain Policy with Untrusted Domains</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/1004.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-1004 Sensitive Cookie Without 'HttpOnly' Flag</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/1032.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-1032 OWASP Top Ten 2017 Category A6 - Security Misconfiguration</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/1174.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-1174 ASP.NET Misconfiguration: Improper Model Validation</a></p>",
        "code": "A05:2021",
        "sort_order": 5
    },
    {
        "tags":
        [
            "A06:2021 – Vulnerable and Outdated Components"
        ],
        "testcase": "Vulnerable and Outdated Components",
        "details": "<h2>Factors</h2><table style=\"width:997.312px;\"><tbody><tr><td><p><strong>CWEs Mapped</strong></p></td><td><p><strong>Max Incidence Rate</strong></p></td><td><p><strong>Avg Incidence Rate</strong></p></td><td><p><strong>Max Coverage</strong></p></td><td><p><strong>Avg Coverage</strong></p></td><td><p><strong>Avg Weighted Exploit</strong></p></td><td><p><strong>Avg Weighted Impact</strong></p></td><td><p><strong>Total Occurrences</strong></p></td><td><p><strong>Total CVEs</strong></p></td></tr><tr><td><p>3</p></td><td><p>27.96%</p></td><td><p>8.77%</p></td><td><p>51.78%</p></td><td><p>22.47%</p></td><td><p>5.00</p></td><td><p>5.00</p></td><td><p>30,457</p></td><td><p>0</p></td></tr></tbody></table><h2></h2><h2>Overview</h2><p>It was #2 from the Top 10 community survey but also had enough data to make the Top 10 via data. Vulnerable Components are a known issue that we struggle to test and assess risk and is the only category to not have any Common Vulnerability and Exposures (CVEs) mapped to the included CWEs, so a default exploits/impact weight of 5.0 is used. Notable CWEs included are <em>CWE-1104: Use of Unmaintained Third-Party Components</em> and the two CWEs from Top 10 2013 and 2017.</p><h2></h2><h2>Description</h2><p>You are likely vulnerable:</p><ul><li>If you do not know the versions of all components you use (both client-side and server-side). This includes components you directly use as well as nested dependencies.</li><li>If the software is vulnerable, unsupported, or out of date. This includes the OS, web/application server, database management system (DBMS), applications, APIs and all components, runtime environments, and libraries.</li><li>If you do not scan for vulnerabilities regularly and subscribe to security bulletins related to the components you use.</li><li>If you do not fix or upgrade the underlying platform, frameworks, and dependencies in a risk-based, timely fashion. This commonly happens in environments when patching is a monthly or quarterly task under change control, leaving organizations open to days or months of unnecessary exposure to fixed vulnerabilities.</li><li>If software developers do not test the compatibility of updated, upgraded, or patched libraries.</li><li>If you do not secure the components’ configurations (see <a href=\"https://owasp.org/Top10/A05_2021-Security_Misconfiguration/\" rel=\"noopener noreferrer\" target=\"_blank\">A05:2021-Security Misconfiguration</a>).</li></ul><h2></h2><h2>How to Prevent</h2><p>There should be a patch management process in place to:</p><ul><li>Remove unused dependencies, unnecessary features, components, files, and documentation.</li><li>Continuously inventory the versions of both client-side and server-side components (e.g., frameworks, libraries) and their dependencies using tools like versions, OWASP Dependency Check, retire.js, etc. Continuously monitor sources like Common Vulnerability and Exposures (CVE) and National Vulnerability Database (NVD) for vulnerabilities in the components. Use software composition analysis tools to automate the process. Subscribe to email alerts for security vulnerabilities related to components you use.</li><li>Only obtain components from official sources over secure links. Prefer signed packages to reduce the chance of including a modified, malicious component (see <a href=\"https://owasp.org/Top10/A08_2021-Software_and_Data_Integrity_Failures/\" rel=\"noopener noreferrer\" target=\"_blank\">A08:2021-Software and Data Integrity Failures</a>).</li><li>Monitor for libraries and components that are unmaintained or do not create security patches for older versions. If patching is not possible, consider deploying a virtual patch to monitor, detect, or protect against the discovered issue.</li></ul><p>Every organization must ensure an ongoing plan for monitoring, triaging, and applying updates or configuration changes for the lifetime of the application or portfolio.</p><h2></h2><h2>Example Attack Scenarios</h2><p><strong>Scenario #1:</strong> Components typically run with the same privileges as the application itself, so flaws in any component can result in serious impact. Such flaws can be accidental (e.g., coding error) or intentional (e.g., a backdoor in a component). Some example exploitable component vulnerabilities discovered are:</p><ul><li>CVE-2017-5638, a Struts 2 remote code execution vulnerability that enables the execution of arbitrary code on the server, has been blamed for significant breaches.</li><li>While the internet of things (IoT) is frequently difficult or impossible to patch, the importance of patching them can be great (e.g., biomedical devices).</li></ul><p>There are automated tools to help attackers find unpatched or misconfigured systems. For example, the Shodan IoT search engine can help you find devices that still suffer from Heartbleed vulnerability patched in April 2014.</p><h2></h2><h2>References</h2><ul><li><a href=\"https://owasp.org/www-project-application-security-verification-standard\" rel=\"noopener noreferrer\" target=\"_blank\">OWASP Application Security Verification Standard: V1 Architecture, design and threat modelling</a></li><li><a href=\"https://owasp.org/www-project-dependency-check\" rel=\"noopener noreferrer\" target=\"_blank\">OWASP Dependency Check (for Java and .NET libraries)</a></li><li><a href=\"https://owasp.org/www-project-web-security-testing-guide/latest/4-Web_Application_Security_Testing/01-Information_Gathering/10-Map_Application_Architecture\" rel=\"noopener noreferrer\" target=\"_blank\">OWASP Testing Guide - Map Application Architecture (OTG-INFO-010)</a></li><li><a href=\"https://owasp.org/www-community/Virtual_Patching_Best_Practices\" rel=\"noopener noreferrer\" target=\"_blank\">OWASP Virtual Patching Best Practices</a></li><li><a href=\"https://cdn2.hubspot.net/hub/203759/file-1100864196-pdf/docs/Contrast_-_Insecure_Libraries_2014.pdf\" rel=\"noopener noreferrer\" target=\"_blank\">The Unfortunate Reality of Insecure Libraries</a></li><li><a href=\"https://www.cvedetails.com/version-search.php\" rel=\"noopener noreferrer\" target=\"_blank\">MITRE Common Vulnerabilities and Exposures (CVE) search</a></li><li><a href=\"https://nvd.nist.gov/\" rel=\"noopener noreferrer\" target=\"_blank\">National Vulnerability Database (NVD)</a></li><li><a href=\"https://github.com/retirejs/retire.js/\" rel=\"noopener noreferrer\" target=\"_blank\">Retire.js for detecting known vulnerable JavaScript libraries</a></li><li><a href=\"https://github.com/advisories\" rel=\"noopener noreferrer\" target=\"_blank\">GitHub Advisory Database</a></li><li><a href=\"https://rubysec.com/\" rel=\"noopener noreferrer\" target=\"_blank\">Ruby Libraries Security Advisory Database and Tools</a></li><li><a href=\"https://safecode.org/publication/SAFECode_Software_Integrity_Controls0610.pdf\" rel=\"noopener noreferrer\" target=\"_blank\">SAFECode Software Integrity Controls [PDF]</a></li></ul><h2></h2><h2>List of Mapped CWEs</h2><p><a href=\"https://cwe.mitre.org/data/definitions/937.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-937 OWASP Top 10 2013: Using Components with Known Vulnerabilities</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/1035.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-1035 2017 Top 10 A9: Using Components with Known Vulnerabilities</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/1104.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-1104 Use of Unmaintained Third Party Components</a></p>",
        "code": "A06:2021",
        "sort_order": 6
    },
    {
        "tags":
        [
            "A07:2021 – Identification and Authentication Failures"
        ],
        "testcase": "Identification and Authentication Failures",
        "details": "<h2>Factors</h2><table style=\"width:997.312px;\"><tbody><tr><td><p><strong>CWEs Mapped</strong></p></td><td><p><strong>Max Incidence Rate</strong></p></td><td><p><strong>Avg Incidence Rate</strong></p></td><td><p><strong>Avg Weighted Exploit</strong></p></td><td><p><strong>Avg Weighted Impact</strong></p></td><td><p><strong>Max Coverage</strong></p></td><td><p><strong>Avg Coverage</strong></p></td><td><p><strong>Total Occurrences</strong></p></td><td><p><strong>Total CVEs</strong></p></td></tr><tr><td><p>22</p></td><td><p>14.84%</p></td><td><p>2.55%</p></td><td><p>7.40</p></td><td><p>6.50</p></td><td><p>79.51%</p></td><td><p>45.72%</p></td><td><p>132,195</p></td><td><p>3,897</p></td></tr></tbody></table><h2></h2><h2>Overview</h2><p>Previously known as <em>Broken Authentication</em>, this category slid down from the second position and now includes Common Weakness Enumerations (CWEs) related to identification failures. Notable CWEs included are <em>CWE-297: Improper Validation of Certificate with Host Mismatch</em>, <em>CWE-287: Improper Authentication</em>, and <em>CWE-384: Session Fixation</em>.</p><h2></h2><h2>Description</h2><p>Confirmation of the user's identity, authentication, and session management is critical to protect against authentication-related attacks. There may be authentication weaknesses if the application:</p><ul><li>Permits automated attacks such as credential stuffing, where the attacker has a list of valid usernames and passwords.</li><li>Permits brute force or other automated attacks.</li><li>Permits default, weak, or well-known passwords, such as \"Password1\" or \"admin/admin\".</li><li>Uses weak or ineffective credential recovery and forgot-password processes, such as \"knowledge-based answers,\" which cannot be made safe.</li><li>Uses plain text, encrypted, or weakly hashed passwords data stores (see <a href=\"https://owasp.org/Top10/A02_2021-Cryptographic_Failures/\" rel=\"noopener noreferrer\" target=\"_blank\">A02:2021-Cryptographic Failures</a>).</li><li>Has missing or ineffective multi-factor authentication.</li><li>Exposes session identifier in the URL.</li><li>Reuse session identifier after successful login.</li><li>Does not correctly invalidate Session IDs. User sessions or authentication tokens (mainly single sign-on (SSO) tokens) aren't properly invalidated during logout or a period of inactivity.</li></ul><h2></h2><h2>How to Prevent</h2><ul><li>Where possible, implement multi-factor authentication to prevent automated credential stuffing, brute force, and stolen credential reuse attacks.</li><li>Do not ship or deploy with any default credentials, particularly for admin users.</li><li>Implement weak password checks, such as testing new or changed passwords against the top 10,000 worst passwords list.</li><li>Align password length, complexity, and rotation policies with National Institute of Standards and Technology (NIST) 800-63b's guidelines in section 5.1.1 for Memorized Secrets or other modern, evidence-based password policies.</li><li>Ensure registration, credential recovery, and API pathways are hardened against account enumeration attacks by using the same messages for all outcomes.</li><li>Limit or increasingly delay failed login attempts, but be careful not to create a denial of service scenario. Log all failures and alert administrators when credential stuffing, brute force, or other attacks are detected.</li><li>Use a server-side, secure, built-in session manager that generates a new random session ID with high entropy after login. Session identifier should not be in the URL, be securely stored, and invalidated after logout, idle, and absolute timeouts.</li></ul><h2></h2><h2>Example Attack Scenarios</h2><p><strong>Scenario #1:</strong> Credential stuffing, the use of lists of known passwords, is a common attack. Suppose an application does not implement automated threat or credential stuffing protection. In that case, the application can be used as a password oracle to determine if the credentials are valid.</p><p><strong>Scenario #2:</strong> Most authentication attacks occur due to the continued use of passwords as a sole factor. Once considered best practices, password rotation and complexity requirements encourage users to use and reuse weak passwords. Organizations are recommended to stop these practices per NIST 800-63 and use multi-factor authentication.</p><p><strong>Scenario #3:</strong> Application session timeouts aren't set correctly. A user uses a public computer to access an application. Instead of selecting \"logout,\" the user simply closes the browser tab and walks away. An attacker uses the same browser an hour later, and the user is still authenticated.</p><h2></h2><h2>References</h2><ul><li><a href=\"https://owasp.org/www-project-proactive-controls/v3/en/c6-digital-identity\" rel=\"noopener noreferrer\" target=\"_blank\">OWASP Proactive Controls: Implement Digital Identity</a></li><li><a href=\"https://owasp.org/www-project-application-security-verification-standard\" rel=\"noopener noreferrer\" target=\"_blank\">OWASP Application Security Verification Standard: V2 authentication</a></li><li><a href=\"https://owasp.org/www-project-application-security-verification-standard\" rel=\"noopener noreferrer\" target=\"_blank\">OWASP Application Security Verification Standard: V3 Session Management</a></li><li><a href=\"https://owasp.org/www-project-web-security-testing-guide/stable/4-Web_Application_Security_Testing/03-Identity_Management_Testing/README\" rel=\"noopener noreferrer\" target=\"_blank\">OWASP Testing Guide: Identity</a>, <a href=\"https://owasp.org/www-project-web-security-testing-guide/stable/4-Web_Application_Security_Testing/04-Authentication_Testing/README\" rel=\"noopener noreferrer\" target=\"_blank\">Authentication</a></li><li><a href=\"https://cheatsheetseries.owasp.org/cheatsheets/Authentication_Cheat_Sheet.html\" rel=\"noopener noreferrer\" target=\"_blank\">OWASP Cheat Sheet: Authentication</a></li><li><a href=\"https://cheatsheetseries.owasp.org/cheatsheets/Credential_Stuffing_Prevention_Cheat_Sheet.html\" rel=\"noopener noreferrer\" target=\"_blank\">OWASP Cheat Sheet: Credential Stuffing</a></li><li><a href=\"https://cheatsheetseries.owasp.org/cheatsheets/Forgot_Password_Cheat_Sheet.html\" rel=\"noopener noreferrer\" target=\"_blank\">OWASP Cheat Sheet: Forgot Password</a></li><li><a href=\"https://cheatsheetseries.owasp.org/cheatsheets/Session_Management_Cheat_Sheet.html\" rel=\"noopener noreferrer\" target=\"_blank\">OWASP Cheat Sheet: Session Management</a></li><li><a href=\"https://owasp.org/www-project-automated-threats-to-web-applications/\" rel=\"noopener noreferrer\" target=\"_blank\">OWASP Automated Threats Handbook</a></li><li><a href=\"https://pages.nist.gov/800-63-3/sp800-63b.html#memsecret\" rel=\"noopener noreferrer\" target=\"_blank\">NIST 800-63b: 5.1.1 Memorized Secrets</a></li></ul><h2></h2><h2>List of Mapped CWEs</h2><p><a href=\"https://cwe.mitre.org/data/definitions/255.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-255 Credentials Management Errors</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/259.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-259 Use of Hard-coded Password</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/287.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-287 Improper Authentication</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/288.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-288 Authentication Bypass Using an Alternate Path or Channel</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/290.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-290 Authentication Bypass by Spoofing</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/294.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-294 Authentication Bypass by Capture-replay</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/295.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-295 Improper Certificate Validation</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/297.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-297 Improper Validation of Certificate with Host Mismatch</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/300.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-300 Channel Accessible by Non-Endpoint</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/302.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-302 Authentication Bypass by Assumed-Immutable Data</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/304.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-304 Missing Critical Step in Authentication</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/306.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-306 Missing Authentication for Critical Function</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/307.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-307 Improper Restriction of Excessive Authentication Attempts</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/346.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-346 Origin Validation Error</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/384.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-384 Session Fixation</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/521.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-521 Weak Password Requirements</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/613.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-613 Insufficient Session Expiration</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/620.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-620 Unverified Password Change</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/640.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-640 Weak Password Recovery Mechanism for Forgotten Password</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/798.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-798 Use of Hard-coded Credentials</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/940.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-940 Improper Verification of Source of a Communication Channel</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/1216.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-1216 Lockout Mechanism Errors</a></p>",
        "code": "A07:2021",
        "sort_order": 7
    },
    {
        "tags":
        [
            "A08:2021 – Software and Data Integrity Failures"
        ],
        "testcase": "Software and Data Integrity Failures",
        "details": "<h2>Factors</h2><table style=\"width:997.312px;\"><tbody><tr><td><p><strong>CWEs Mapped</strong></p></td><td><p><strong>Max Incidence Rate</strong></p></td><td><p><strong>Avg Incidence Rate</strong></p></td><td><p><strong>Avg Weighted Exploit</strong></p></td><td><p><strong>Avg Weighted Impact</strong></p></td><td><p><strong>Max Coverage</strong></p></td><td><p><strong>Avg Coverage</strong></p></td><td><p><strong>Total Occurrences</strong></p></td><td><p><strong>Total CVEs</strong></p></td></tr><tr><td><p>10</p></td><td><p>16.67%</p></td><td><p>2.05%</p></td><td><p>6.94</p></td><td><p>7.94</p></td><td><p>75.04%</p></td><td><p>45.35%</p></td><td><p>47,972</p></td><td><p>1,152</p></td></tr></tbody></table><h2></h2><h2>Overview</h2><p>A new category for 2021 focuses on making assumptions related to software updates, critical data, and CI/CD pipelines without verifying integrity. One of the highest weighted impacts from Common Vulnerability and Exposures/Common Vulnerability Scoring System (CVE/CVSS) data. Notable Common Weakness Enumerations (CWEs) include <em>CWE-829: Inclusion of Functionality from Untrusted Control Sphere</em>, <em>CWE-494: Download of Code Without Integrity Check</em>, and <em>CWE-502: Deserialization of Untrusted Data</em>.</p><h2></h2><h2>Description</h2><p>Software and data integrity failures relate to code and infrastructure that does not protect against integrity violations. An example of this is where an application relies upon plugins, libraries, or modules from untrusted sources, repositories, and content delivery networks (CDNs). An insecure CI/CD pipeline can introduce the potential for unauthorized access, malicious code, or system compromise. Lastly, many applications now include auto-update functionality, where updates are downloaded without sufficient integrity verification and applied to the previously trusted application. Attackers could potentially upload their own updates to be distributed and run on all installations. Another example is where objects or data are encoded or serialized into a structure that an attacker can see and modify is vulnerable to insecure deserialization.</p><h2></h2><h2>How to Prevent</h2><ul><li>Use digital signatures or similar mechanisms to verify the software or data is from the expected source and has not been altered.</li><li>Ensure libraries and dependencies, such as npm or Maven, are consuming trusted repositories. If you have a higher risk profile, consider hosting an internal known-good repository that's vetted.</li><li>Ensure that a software supply chain security tool, such as OWASP Dependency Check or OWASP CycloneDX, is used to verify that components do not contain known vulnerabilities</li><li>Ensure that there is a review process for code and configuration changes to minimize the chance that malicious code or configuration could be introduced into your software pipeline.</li><li>Ensure that your CI/CD pipeline has proper segregation, configuration, and access control to ensure the integrity of the code flowing through the build and deploy processes.</li><li>Ensure that unsigned or unencrypted serialized data is not sent to untrusted clients without some form of integrity check or digital signature to detect tampering or replay of the serialized data</li></ul><h2></h2><h2>Example Attack Scenarios</h2><p><strong>Scenario #1 Update without signing:</strong> Many home routers, set-top boxes, device firmware, and others do not verify updates via signed firmware. Unsigned firmware is a growing target for attackers and is expected to only get worse. This is a major concern as many times there is no mechanism to remediate other than to fix in a future version and wait for previous versions to age out.</p><p><strong>Scenario #2 SolarWinds malicious update</strong>: Nation-states have been known to attack update mechanisms, with a recent notable attack being the SolarWinds Orion attack. The company that develops the software had secure build and update integrity processes. Still, these were able to be subverted, and for several months, the firm distributed a highly targeted malicious update to more than 18,000 organizations, of which around 100 or so were affected. This is one of the most far-reaching and most significant breaches of this nature in history.</p><p><strong>Scenario #3 Insecure Deserialization:</strong> A React application calls a set of Spring Boot microservices. Being functional programmers, they tried to ensure that their code is immutable. The solution they came up with is serializing the user state and passing it back and forth with each request. An attacker notices the \"rO0\" Java object signature (in base64) and uses the Java Serial Killer tool to gain remote code execution on the application server.</p><h2></h2><h2>References</h2><ul><li>[OWASP Cheat Sheet: Software Supply Chain Security](Coming Soon)</li><li>[OWASP Cheat Sheet: Secure build and deployment](Coming Soon)</li><li><a href=\"https://cheatsheetseries.owasp.org/cheatsheets/Infrastructure_as_Code_Security_Cheat_Sheet.html\" rel=\"noopener noreferrer\" target=\"_blank\">OWASP Cheat Sheet: Infrastructure as Code</a></li><li><a href=\"https://wiki.owasp.org/index.php/Deserialization_Cheat_Sheet\" rel=\"noopener noreferrer\" target=\"_blank\">OWASP Cheat Sheet: Deserialization</a></li><li><a href=\"https://safecode.org/publication/SAFECode_Software_Integrity_Controls0610.pdf\" rel=\"noopener noreferrer\" target=\"_blank\">SAFECode Software Integrity Controls</a></li><li><a href=\"https://www.npr.org/2021/04/16/985439655/a-worst-nightmare-cyberattack-the-untold-story-of-the-solarwinds-hack\" rel=\"noopener noreferrer\" target=\"_blank\">A 'Worst Nightmare' Cyberattack: The Untold Story Of The SolarWinds Hack</a></li><li><a href=\"https://about.codecov.io/security-update\" rel=\"noopener noreferrer\" target=\"_blank\">CodeCov Bash Uploader Compromise</a></li><li><a href=\"https://www.manning.com/books/securing-devops\" rel=\"noopener noreferrer\" target=\"_blank\">Securing DevOps by Julien Vehent</a></li></ul><h2></h2><h2>List of Mapped CWEs</h2><p><a href=\"https://cwe.mitre.org/data/definitions/345.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-345 Insufficient Verification of Data Authenticity</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/353.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-353 Missing Support for Integrity Check</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/426.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-426 Untrusted Search Path</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/494.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-494 Download of Code Without Integrity Check</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/502.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-502 Deserialization of Untrusted Data</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/565.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-565 Reliance on Cookies without Validation and Integrity Checking</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/784.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-784 Reliance on Cookies without Validation and Integrity Checking in a Security Decision</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/829.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-829 Inclusion of Functionality from Untrusted Control Sphere</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/830.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-830 Inclusion of Web Functionality from an Untrusted Source</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/915.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-915 Improperly Controlled Modification of Dynamically-Determined Object Attributes</a></p>",
        "code": "A08:2021",
        "sort_order": 8
    },
    {
        "tags":
        [
            "A09:2021 – Security Logging and Monitoring Failures"
        ],
        "testcase": "Security Logging and Monitoring Failures",
        "details": "<h2>Factors</h2><table style=\"width:997.312px;\"><tbody><tr><td><p><strong>CWEs Mapped</strong></p></td><td><p><strong>Max Incidence Rate</strong></p></td><td><p><strong>Avg Incidence Rate</strong></p></td><td><p><strong>Avg Weighted Exploit</strong></p></td><td><p><strong>Avg Weighted Impact</strong></p></td><td><p><strong>Max Coverage</strong></p></td><td><p><strong>Avg Coverage</strong></p></td><td><p><strong>Total Occurrences</strong></p></td><td><p><strong>Total CVEs</strong></p></td></tr><tr><td><p>4</p></td><td><p>19.23%</p></td><td><p>6.51%</p></td><td><p>6.87</p></td><td><p>4.99</p></td><td><p>53.67%</p></td><td><p>39.97%</p></td><td><p>53,615</p></td><td><p>242</p></td></tr></tbody></table><h2></h2><h2>Overview</h2><p>Security logging and monitoring came from the Top 10 community survey (#3), up slightly from the tenth position in the OWASP Top 10 2017. Logging and monitoring can be challenging to test, often involving interviews or asking if attacks were detected during a penetration test. There isn't much CVE/CVSS data for this category, but detecting and responding to breaches is critical. Still, it can be very impactful for accountability, visibility, incident alerting, and forensics. This category expands beyond <em>CWE-778 Insufficient Logging</em> to include <em>CWE-117 Improper Output Neutralization for Logs</em>, <em>CWE-223 Omission of Security-relevant Information</em>, and <em>CWE-532</em> <em>Insertion of Sensitive Information into Log File</em>.</p><h2></h2><h2>Description</h2><p>Returning to the OWASP Top 10 2021, this category is to help detect, escalate, and respond to active breaches. Without logging and monitoring, breaches cannot be detected. Insufficient logging, detection, monitoring, and active response occurs any time:</p><ul><li>Auditable events, such as logins, failed logins, and high-value transactions, are not logged.</li><li>Warnings and errors generate no, inadequate, or unclear log messages.</li><li>Logs of applications and APIs are not monitored for suspicious activity.</li><li>Logs are only stored locally.</li><li>Appropriate alerting thresholds and response escalation processes are not in place or effective.</li><li>Penetration testing and scans by dynamic application security testing (DAST) tools (such as OWASP ZAP) do not trigger alerts.</li><li>The application cannot detect, escalate, or alert for active attacks in real-time or near real-time.</li><li>You are vulnerable to information leakage by making logging and alerting events visible to a user or an attacker (see <a href=\"https://owasp.org/Top10/A01_2021-Broken_Access_Control/\" rel=\"noopener noreferrer\" target=\"_blank\">A01:2021-Broken Access Control</a>).</li><li>You are vulnerable to injections or attacks on the logging or monitoring systems if log data is not correctly encoded.</li></ul><h2></h2><h2>How to Prevent</h2><p>Developers should implement some or all the following controls, depending on the risk of the application:</p><ul><li>Ensure all login, access control, and server-side input validation failures can be logged with sufficient user context to identify suspicious or malicious accounts and held for enough time to allow delayed forensic analysis.</li><li>Ensure that logs are generated in a format that log management solutions can easily consume.</li><li>Ensure log data is encoded correctly to prevent injections or attacks on the logging or monitoring systems.</li><li>Ensure high-value transactions have an audit trail with integrity controls to prevent tampering or deletion, such as append-only database tables or similar.</li><li>DevSecOps teams should establish effective monitoring and alerting such that suspicious activities are detected and responded to quickly.</li><li>Establish or adopt an incident response and recovery plan, such as National Institute of Standards and Technology (NIST) 800-61r2 or later.</li></ul><p>There are commercial and open-source application protection frameworks such as the OWASP ModSecurity Core Rule Set, and open-source log correlation software, such as the Elasticsearch, Logstash, Kibana (ELK) stack, that feature custom dashboards and alerting.</p><h2></h2><h2>Example Attack Scenarios</h2><p><strong>Scenario #1:</strong> A children's health plan provider's website operator couldn't detect a breach due to a lack of monitoring and logging. An external party informed the health plan provider that an attacker had accessed and modified thousands of sensitive health records of more than 3.5 million children. A post-incident review found that the website developers had not addressed significant vulnerabilities. As there was no logging or monitoring of the system, the data breach could have been in progress since 2013, a period of more than seven years.</p><p><strong>Scenario #2:</strong> A major Indian airline had a data breach involving more than ten years' worth of personal data of millions of passengers, including passport and credit card data. The data breach occurred at a third-party cloud hosting provider, who notified the airline of the breach after some time.</p><p><strong>Scenario #3:</strong> A major European airline suffered a GDPR reportable breach. The breach was reportedly caused by payment application security vulnerabilities exploited by attackers, who harvested more than 400,000 customer payment records. The airline was fined 20 million pounds as a result by the privacy regulator.</p><h2></h2><h2>References</h2><ul><li><a href=\"https://owasp.org/www-project-proactive-controls/v3/en/c9-security-logging.html\" rel=\"noopener noreferrer\" target=\"_blank\">OWASP Proactive Controls: Implement Logging and Monitoring</a></li><li><a href=\"https://owasp.org/www-project-application-security-verification-standard\" rel=\"noopener noreferrer\" target=\"_blank\">OWASP Application Security Verification Standard: V7 Logging and Monitoring</a></li><li><a href=\"https://owasp.org/www-project-web-security-testing-guide/v41/4-Web_Application_Security_Testing/08-Testing_for_Error_Handling/01-Testing_for_Error_Code\" rel=\"noopener noreferrer\" target=\"_blank\">OWASP Testing Guide: Testing for Detailed Error Code</a></li><li><a href=\"https://cheatsheetseries.owasp.org/cheatsheets/Application_Logging_Vocabulary_Cheat_Sheet.html\" rel=\"noopener noreferrer\" target=\"_blank\">OWASP Cheat Sheet: Application Logging Vocabulary</a></li><li><a href=\"https://cheatsheetseries.owasp.org/cheatsheets/Logging_Cheat_Sheet.html\" rel=\"noopener noreferrer\" target=\"_blank\">OWASP Cheat Sheet: Logging</a></li><li><a href=\"https://csrc.nist.gov/publications/detail/sp/1800-11/final\" rel=\"noopener noreferrer\" target=\"_blank\">Data Integrity: Recovering from Ransomware and Other Destructive Events</a></li><li><a href=\"https://csrc.nist.gov/publications/detail/sp/1800-25/final\" rel=\"noopener noreferrer\" target=\"_blank\">Data Integrity: Identifying and Protecting Assets Against Ransomware and Other Destructive Events</a></li><li><a href=\"https://csrc.nist.gov/publications/detail/sp/1800-26/final\" rel=\"noopener noreferrer\" target=\"_blank\">Data Integrity: Detecting and Responding to Ransomware and Other Destructive Events</a></li></ul><h2></h2><h2>List of Mapped CWEs</h2><p><a href=\"https://cwe.mitre.org/data/definitions/117.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-117 Improper Output Neutralization for Logs</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/223.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-223 Omission of Security-relevant Information</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/532.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-532 Insertion of Sensitive Information into Log File</a></p><p><a href=\"https://cwe.mitre.org/data/definitions/778.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-778 Insufficient Logging</a></p>",
        "code": "A09:2021",
        "sort_order": 9
    },
    {
        "tags":
        [
            "A10:2021 – Server-Side Request Forgery (SSRF)"
        ],
        "testcase": "Server-Side Request Forgery (SSRF)",
        "details": "<h2>Factors</h2><table style=\"width:997.312px;\"><tbody><tr><td><p><strong>CWEs Mapped</strong></p></td><td><p><strong>Max Incidence Rate</strong></p></td><td><p><strong>Avg Incidence Rate</strong></p></td><td><p><strong>Avg Weighted Exploit</strong></p></td><td><p><strong>Avg Weighted Impact</strong></p></td><td><p><strong>Max Coverage</strong></p></td><td><p><strong>Avg Coverage</strong></p></td><td><p><strong>Total Occurrences</strong></p></td><td><p><strong>Total CVEs</strong></p></td></tr><tr><td><p>1</p></td><td><p>2.72%</p></td><td><p>2.72%</p></td><td><p>8.28</p></td><td><p>6.72</p></td><td><p>67.72%</p></td><td><p>67.72%</p></td><td><p>9,503</p></td><td><p>385</p></td></tr></tbody></table><h2></h2><h2>Overview</h2><p>This category is added from the Top 10 community survey (#1). The data shows a relatively low incidence rate with above average testing coverage and above-average Exploit and Impact potential ratings. As new entries are likely to be a single or small cluster of Common Weakness Enumerations (CWEs) for attention and awareness, the hope is that they are subject to focus and can be rolled into a larger category in a future edition.</p><h2></h2><h2>Description</h2><p>SSRF flaws occur whenever a web application is fetching a remote resource without validating the user-supplied URL. It allows an attacker to coerce the application to send a crafted request to an unexpected destination, even when protected by a firewall, VPN, or another type of network access control list (ACL).</p><p>As modern web applications provide end-users with convenient features, fetching a URL becomes a common scenario. As a result, the incidence of SSRF is increasing. Also, the severity of SSRF is becoming higher due to cloud services and the complexity of architectures.</p><h2></h2><h2>How to Prevent</h2><p>Developers can prevent SSRF by implementing some or all the following defense in depth controls:</p><h3><strong>From Network layer</strong></h3><ul><li>Segment remote resource access functionality in separate networks to reduce the impact of SSRF</li><li>Enforce “deny by default” firewall policies or network access control rules to block all but essential intranet traffic.</li><li><em>Hints:</em></li><li>~ Establish an ownership and a lifecycle for firewall rules based on applications.</li><li>~ Log all accepted <em>and</em> blocked network flows on firewalls (see <a href=\"https://owasp.org/Top10/A09_2021-Security_Logging_and_Monitoring_Failures/\" rel=\"noopener noreferrer\" target=\"_blank\">A09:2021-Security Logging and Monitoring Failures</a>).</li></ul><h3><strong>From Application layer:</strong></h3><ul><li>Sanitize and validate all client-supplied input data</li><li>Enforce the URL schema, port, and destination with a positive allow list</li><li>Do not send raw responses to clients</li><li>Disable HTTP redirections</li><li>Be aware of the URL consistency to avoid attacks such as DNS rebinding and “time of check, time of use” (TOCTOU) race conditions</li></ul><p>Do not mitigate SSRF via the use of a deny list or regular expression. Attackers have payload lists, tools, and skills to bypass deny lists.</p><h3><strong>Additional Measures to consider:</strong></h3><ul><li>Don't deploy other security relevant services on front systems (e.g. OpenID). Control local traffic on these systems (e.g. localhost)</li><li>For frontends with dedicated and manageable user groups use network encryption (e.g. VPNs) on independent systems to consider very high protection needs</li></ul><h2></h2><h2>Example Attack Scenarios</h2><p>Attackers can use SSRF to attack systems protected behind web application firewalls, firewalls, or network ACLs, using scenarios such as:</p><p><strong>Scenario #1:</strong> Port scan internal servers – If the network architecture is unsegmented, attackers can map out internal networks and determine if ports are open or closed on internal servers from connection results or elapsed time to connect or reject SSRF payload connections.</p><p><strong>Scenario #2:</strong> Sensitive data exposure – Attackers can access local files or internal services to gain sensitive information such as file:///etc/passwd and http://localhost:28017/.</p><p><strong>Scenario #3:</strong> Access metadata storage of cloud services – Most cloud providers have metadata storage such as http://169.254.169.254/. An attacker can read the metadata to gain sensitive information.</p><p><strong>Scenario #4:</strong> Compromise internal services – The attacker can abuse internal services to conduct further attacks such as Remote Code Execution (RCE) or Denial of Service (DoS).</p><h2></h2><h2>References</h2><ul><li><a href=\"https://cheatsheetseries.owasp.org/cheatsheets/Server_Side_Request_Forgery_Prevention_Cheat_Sheet.html\" rel=\"noopener noreferrer\" target=\"_blank\">OWASP - Server-Side Request Forgery Prevention Cheat Sheet</a></li><li><a href=\"https://portswigger.net/web-security/ssrf\" rel=\"noopener noreferrer\" target=\"_blank\">PortSwigger - Server-side request forgery (SSRF)</a></li><li><a href=\"https://www.acunetix.com/blog/articles/server-side-request-forgery-vulnerability/\" rel=\"noopener noreferrer\" target=\"_blank\">Acunetix - What is Server-Side Request Forgery (SSRF)?</a></li><li><a href=\"https://cheatsheetseries.owasp.org/assets/Server_Side_Request_Forgery_Prevention_Cheat_Sheet_SSRF_Bible.pdf\" rel=\"noopener noreferrer\" target=\"_blank\">SSRF bible</a></li><li><a href=\"https://www.blackhat.com/docs/us-17/thursday/us-17-Tsai-A-New-Era-Of-SSRF-Exploiting-URL-Parser-In-Trending-Programming-Languages.pdf\" rel=\"noopener noreferrer\" target=\"_blank\">A New Era of SSRF - Exploiting URL Parser in Trending Programming Languages!</a></li></ul><h2></h2><h2>List of Mapped CWEs</h2><p><a href=\"https://cwe.mitre.org/data/definitions/918.html\" rel=\"noopener noreferrer\" target=\"_blank\">CWE-918 Server-Side Request Forgery (SSRF)</a></p>",
        "code": "A10:2021",
        "sort_order": 10
    }
]
